const songs = {};

// #region kamen_rider 
songs.kamen_rider = "仮面ライダーBLACK\n\n\n時を超えろ 空を駆けろ この星のため\n君は見たか 愛が真っ紅に燃えるのを\n暗い闇の底で 危険な罠が待つ\n\n信じる奴が 正義(ジャスティス)\n真実の王者\n夢を見続ける事が 俺のファンタジー\n生きることが好きさ 蒼く浮かぶ宇宙\n時を超えろ 空を駆けろ この星のため\n熱く燃やせ 涙 流せ 明日という日に\n仮面ライダー BLACK\n仮面ライダー BLACK\n\n黒く光るボディ ハートに血が通う\n風が運ぶ歌に気持ちがふと揺れる\n\n支配したがる魔術師(マジシャン)\n\n妖しげな超能力\n\n闘う時は 戦士(ソルジャー) 俺の誇りさ\nこの地球が好きさ 心許した友\n\n永遠に守れ 若さ弾け この愛のため\n\n現在を燃やせ 強く生きろ 今日という日を\n仮面ライダー BLACK\n仮面ライダー BLACK\n\n信じる奴が 正義(ジャスティス)\n真実の王者\n夢を見続ける事が 俺のファンタジー\n生きることが好きさ 蒼く浮かぶ宇宙\n時を超えろ 空を駆けろ この星のため\n熱く燃やせ  涙  流せ 明日という日に\n仮面ライダー BLACK\n仮面ライダー BLACK";
// #endregion


module.exports = songs;


